Revit 2027 API
BuiltInFailures.FamilyFailures.ContainsSharedSameNameFamily Property
 Family '[Family Name]' contains a shared family of the same name. Please rename one of the two families before loading!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContainsSharedSameNameFamily { get; }
Public Shared ReadOnly Property ContainsSharedSameNameFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContainsSharedSameNameFamily {
	FailureDefinitionId^ get ();
}
static member ContainsSharedSameNameFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace